/* Розробити клас StringRow, який в подальшому буде використовуватися для роботи з рядками. Клас повинен містити:
конструктор за замовчуванням, що дозволяє створити рядок довжиною 80 символів;
конструктор, що дозволяє створювати рядок довільного розміру;
конструктор, який створює об'єкт і ініціалізує його рядком, отриманим від користувача.
Клас повинен містити методи для введення рядків з клавіатури і виведення рядків на екран. */


using System;

namespace _304
{
    class Program
    {
        static void Main(string[] args)
        {
            StringRow s1 = new StringRow();
            s1.ShowRow();

            StringRow s2 = new StringRow(1);
            s2.ShowRow();
            
            StringRow s3 = new StringRow(StringRow.ReadRow());
            s3.ShowRow(); 
        }
    }
}
